;tier 0
[AbiziMisfitSparkMecSuit X2SparkArmorTemplate_DLC_3]
FriendlyName="错配的机器装甲"
FriendlyNamePlural="错配的机器装甲"
BriefSummary="我们尝试为我们的机械化士兵使用基本的机器护甲，但它不太合适。如有必要，我们可以派他们装备他的护甲。不过，它不会很有用。" 
TacticalText="永远不要派遣装备此套装的机械化士兵。"

;tier 1
[AbiziMecSuit1 X2SparkArmorTemplate_DLC_3]
FriendlyName="原型机械化套装- 欧几里得"
FriendlyNamePlural="原型机械化套装"
BriefSummary="这是我们能做的最基本的机械化套装。它允许机械化士兵舒适地战斗，但他们没有获得任何奖励。" 
TacticalText="将套装升级到 毕达罗加斯 或阿奇德梅斯型号将给机械化士兵带来一些好处。"

[AbiziMecSuit2 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第2型号- 毕达罗加斯"
FriendlyNamePlural="机械化套装第2型号"
BriefSummary="这件机械化套装第2型号- 毕达罗加斯是原型械化套装 - 欧几里得的移动版本。它为机动性提供轻度加成。" 
TacticalText="这是基本机械化套装的更具机动性的版本。它提供机动性加成。"

[AbiziMecSuit3 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第3型号 - 阿奇德梅斯"
FriendlyNamePlural="机械化套装第3型号"
BriefSummary="机械化套装第2 -阿奇德梅斯是原型机械化士兵 - 欧几里得的更耐用版本。它为盔甲提供轻度加成，以及一个实用槽。" 
TacticalText="这是基本机械化套装的更耐用版本。它会提供护甲加成。"

;tier 2
[AbiziMecSuit4 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第4型号 - 拉甘格"
FriendlyNamePlural="机械化套装第5型号"
BriefSummary="机械化套装第4型号 - 拉甘格是我们的原型机械化套装 - 欧几里得的直接升级版，它融合了我们的镀层装甲研究成果。" 
TacticalText="将此套装升级为欧米茄和茂斯模型以获得额外奖励。"

[AbiziMecSuit5 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第5型号 - 欧米茄"
FriendlyNamePlural="机械化套装第5型号"
BriefSummary="机械化套装第5型号 - 欧米茄是我们的机械化套装第2型号 - 毕达罗加斯的直接升级版，它融合了我们的镀层装甲研究成果。" 
TacticalText="提供火箭助推能力，允许机械化士兵重新定位。"

[AbiziMecSuit6 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第6型号 - 茂斯"
FriendlyNamePlural="机械化套装第6型号"
BriefSummary="机械化套装第6型号 - 茂斯是我们的机械化套装第3型号 - 阿奇德梅斯的直接升级版，它融合了我们的镀层装甲研究成果。" 
TacticalText="提供防爆盾牌能力，允许机械化士兵暂时保护他附近免受爆炸物的伤害。"

;tier 3
[AbiziMecSuit7 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第7型号 - 亡灵"
FriendlyNamePlural="机械化套装第7型号"
BriefSummary="机械化套装第7型号 - 亡灵是我们的机械化套装第4型号 - 拉甘格的直接升级版，它融合了我们的动力装甲研究成果。" 
TacticalText="将此士兵升级到阿伊塔或瓦格纳模型以获得额外加成。"

[AbiziMecSuit8 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第8型号 - 阿伊塔"
FriendlyNamePlural="机械化套装第8型号"
BriefSummary="机械化套装第8型号 - 阿伊塔是我们的机械化套装第5型号 - 欧米茄的直接升级版，它融合了我们的动力装甲研究成果。" 
TacticalText="除了火箭助推器能力外，这个机械化套装还提供了更多的机动性。"

[AbiziMecSuit9 X2SparkArmorTemplate_DLC_3]
FriendlyName="机械化套装第9型号 - 瓦格纳"
FriendlyNamePlural="机械化套装第9型号"
BriefSummary="机械化套装第9型号 - 瓦格纳是我们的机械化套装第6型号 - 茂斯的直接升级版，它融合了我们的动力装甲研究成果。" 
TacticalText="除了防爆盾牌能力外，这个机械化套装还提供更高的耐用性。"